Autodesk.Revit.UI.DockablePaneProviderData.VisibleByDefault
Controls the default visibility of the pane upon the first time
the pane/plugin is loaded into Revit.
Remarks:
By default, panes will be created and shown in the Revit UI when
Revit is launched for the first time. Subsequent loads of the Revit
UI will determine the visibility of the panes based upon there state
at the close of the previous Revit session. Providers can set this
to false if they wish there panes to NOT be shown by default.
Since:
2017

Autodesk.Revit.UI.DockablePaneProviderData.EditorInteraction
Defines the interaction this pane has with the Active Editor when the pane becomes active.
Remarks:
Set to KeepAlive to keep the current editor active and
keep active the current selection or Dismiss to dismiss
the Editor and clear the active selection.
Default is to KeepAlive the current editor.
Since:
2017

Autodesk.Revit.UI.DockablePaneProviderData.ContextualHelp
The contextual help associated with the pane.
Remarks:
If set, the contents of this Contextual Help will be used to respond to a user request for help
(typically this is as a result of pressing F1 while the dockable pane has focus).
Since:
2016

Autodesk.Revit.UI.DockablePaneProviderData.InitialState
The initial position of the docking pane.
Remarks:
This position will be used for the first Revit session in which the pane is registered; afterwards, the user is free
to reposition the pane, and the user's saved position will be remembered in future sessions.
Since:
2014

Autodesk.Revit.UI.DockablePaneProviderData.FrameworkElementCreator
A creator that will be called for the pane if the FrameworkElement is not set.
Remarks:
This is more dynamic in nature and allows for embedding things like
WebBrowser controls that cannot be cached for reuse in each pane invocation
but rather needs creating each time.
Since:
2018

Autodesk.Revit.UI.DockablePaneProviderData.FrameworkElement
The Windows Presentation Framework object containing the pane's user interface.
Remarks:
Using a System.Windows.Controls.Page is recommended. This can be null, in which case
it is assumed an IFrameworkElementCreator is provided to create the element on demand.
Since:
2014

Autodesk.Revit.UI.DockablePaneProviderData.GetFrameworkElement
Wrapper function that returns the FrameworkElement for this provider.
Returns:
FrameworkElement to use as the pane's user interface.
Remarks:
If an IFrameworkElementCreator is provided, that will be called to generate the element,
otherwise, the FrameworkElement associated with the provider is returned.
Since:
2018

Autodesk.Revit.UI.DockablePaneProviderData
Information about a new dockable pane being added to the Revit user interface.
Since:
2014